#                    本节课主要内容如下简单描述
# matplotlib.pyplot是一个有命令风格的函数集合，
# 它看起来和MATLAB很相似。每一个pyplot函数都使一副图像做出些许改变，
# 例如创建一幅图，在图中创建一个绘图区域，在绘图区域中添加一条线等等。
# 在matplotlib.pyplot中，各种状态通过函数调用保存起来，以便于可以随时跟踪像当前图像和绘图区域这样的东西。
# 绘图函数是直接作用于当前axes（matplotlib中的专有名词，图形中组成部分，不是数学中的坐标系。）

 # pyplot库基本使用
 # 1.如何绘制一个坐标系 如何确定一个曲线的曲线风格 颜色风格 标记风格
 #   可以绘制散点图 柱状图啥的都可以 很厉害
 # 2.在绘图区域中如何绘制子绘图区域: subplot和subplot2grid
 # 3.如何在绘图中增加文本显示以及中文显示的方法

#  感受:
#   不要求全部掌握 主要是选取恰当的图形展示数据含义
#   例如:能量衰减的情况可以使用坐标系 或者还有柱状图 散点图比例图等等
#                      !!!关键是能力!!!
